docs/leets/0476-Number-Complement.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-03-09 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0476. Number Complement</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-08-21
</div>
<div id="content" class="content">
<header>
<h1 class="title">0476. Number Complement</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb867670">Problem</a>
<ul>
<li><a href="#org621868c">Example:</a></li>
</ul>
</li>
<li><a href="#org76c7434">Solution Description</a>
<ul>
<li><a href="#org7c64915">Efficient Approach:</a></li>
<li><a href="#orgff6926c">Time Complexity: O(b), where b is the number of bits.</a></li>
<li><a href="#org5db1b8b">Space Complexity: O(1), as we are using a constant amount of extra space.</a></li>
</ul>
</li>
<li><a href="#org8eae397">Example</a></li>
<li><a href="#orgdf0e95d">Submission</a></li>
<li><a href="#org83fc171">Solution Code</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgb867670" class="outline-2">
<h2 id="orgb867670">Problem</h2>
<div class="outline-text-2" id="text-orgb867670">
<p>
Given a positive integer <code>num</code>, output its complement number. The complement strategy is to flip the bits of its binary representation.
</p>

<p>
The complement of an integer is formed by inverting the binary digits (changing 0 to 1 and 1 to 0). For example, the binary complement of <code>5</code> (which is <code>101</code> in binary) is <code>2</code> (which is <code>010</code> in binary).
</p>
</div>

<div id="outline-container-org621868c" class="outline-3">
<h3 id="org621868c">Example:</h3>
<div class="outline-text-3" id="text-org621868c">
<ul class="org-ul">
<li>Input: <code>5</code></li>
<li>Output: <code>2</code></li>
<li>Explanation: The binary representation of <code>5</code> is <code>101</code>, and the complement is <code>010</code> which is the binary representation of <code>2</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org76c7434" class="outline-2">
<h2 id="org76c7434">Solution Description</h2>
<div class="outline-text-2" id="text-org76c7434">
<p>
To implement the complement number of a given integer, we need to:
</p>
<ol class="org-ol">
<li>Convert the number into its binary representation.</li>
<li>Invert the bits of this binary representation.</li>
<li>Convert the inverted binary representation back to a decimal number.</li>
</ol>

<p>
Here's how the steps can be translated into code:
</p>
<ol class="org-ol">
<li>Convert the number to binary using <code>num.toString(2)</code>.</li>
<li>Flip each bit (0 to 1 and 1 to 0) by iterating over the string.</li>
<li>Convert the resulting binary string back to a number using <code>parseInt(binaryString, 2)</code>.</li>
</ol>
</div>

<div id="outline-container-org7c64915" class="outline-3">
<h3 id="org7c64915">Efficient Approach:</h3>
<div class="outline-text-3" id="text-org7c64915">
<ol class="org-ol">
<li>Calculate the bit length of the number.</li>
<li>Create a mask which is all bits set to 1 for the length of the number.</li>
<li>XOR the number with the mask to get the complement.</li>
</ol>
</div>
</div>

<div id="outline-container-orgff6926c" class="outline-3">
<h3 id="orgff6926c">Time Complexity: O(b), where b is the number of bits.</h3>
</div>
<div id="outline-container-org5db1b8b" class="outline-3">
<h3 id="org5db1b8b">Space Complexity: O(1), as we are using a constant amount of extra space.</h3>
</div>
</div>

<div id="outline-container-org8eae397" class="outline-2">
<h2 id="org8eae397">Example</h2>
<div class="outline-text-2" id="text-org8eae397">
<p>
Let's take the number <code>5</code>:
</p>
<ol class="org-ol">
<li>Binary form of <code>5</code> is <code>101</code>.</li>
<li>Inverting <code>101</code> gives <code>010</code>.</li>
<li>Convert <code>010</code> to decimal, which is <code>2</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdf0e95d" class="outline-2">
<h2 id="orgdf0e95d">Submission</h2>
<div class="outline-text-2" id="text-orgdf0e95d">
<p>
<a href="https://leetcode.com/submissions/detail/1364078436/">2024-08-22 Number Complement - Submission Detail - LeetCode</a> <code>leetcode.com</code>
</p>
</div>
</div>

<div id="outline-container-org83fc171" class="outline-2">
<h2 id="org83fc171">Solution Code</h2>
<div class="outline-text-2" id="text-org83fc171">
<div class="org-src-container">
<pre class="src src-js">/**
 * @description This function calculates the complement of a given number.
 * @param {number} num - The input number.
 * @returns {number} - The complement of the input number.
 */
function findComplement(num) {
    const bitLength = num.toString(2).length;
    const mask = (1 &lt;&lt; bitLength) - 1;
    const xor = num ^ mask;
    return xor;
}

// Define test cases to validate the solution
const testCases = [
    { num: 5, expected: 2 },
    { num: 1, expected: 0 },
    { num: 7, expected: 0 },
    { num: 10, expected: 5 },
    { num: 0, expected: 1 },
];

// Testing execution
testCases.forEach((test, index) =&gt; {
    const result = findComplement(test.num);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
